config.org
**** apperance
#+begin_src emacs-lisp
(setq org-columns-default-format "%40ITEM(Task) %Effort(EE){:} %CLOCKSUM(Time Spent) %SCHEDULED(Scheduled) %DEADLINE(Deadline)")
(setq org-agenda-custom-commands
    `((" " "Agenda"
       ((agenda ""
               ((org-agenda-span 'week)
                (org-deadline-warning-days 365)))
       (todo "TODO"
             ((org-agenda-overriding-header "Inbox")
              (org-agenda-files '("~/Dropbox/.org/inbox.org"))))
       (todo "NEXT"
             ((org-agenda-overriding-header "In Progress")
              (org-agenda-files '("~/Dropbox/.org/todolist.org"))))
       ;; (todo "TODO"
       ;;       ((org-agenda-overriding-header "Active Projects")
       ;;        (org-agenda-skip-function #'jethro/skip-projects)
       ;;        (org-agenda-files '(,(expand-file-name "projects.org" jethro/org-agenda-directory)))))
       (todo "TODO"
             ((org-agenda-overriding-header "One-off Tasks")
              (org-agenda-files '("~/Dropbox/.org/todolist.org" "~/Dropbox/.org/inbox.org"))
              (org-agenda-skip-function '(org-agenda-skip-entry-if 'deadline 'scheduled)))))))))
#+end_src

**** functions
***** skip project
#+begin_src emacs-lisp
(defun jethro/skip-projects ()
"Skip trees that are projects"
(save-restriction
  (widen)
  (let ((next-headline (save-excursion (or (outline-next-heading) (point-max)))))
    (cond
     ((org-is-habit-p)
      next-headline)
     ((jethro/is-project-p)
      next-headline)
     (t
      nil)))))
#+end_src
